app/controllers/cryps_controller.rb

SELECT "cryps".* FROM "cryps"
---
  def index
    @cryps = Cryp.all

INSERT INTO "cryps" ("symbol", "user_id", "cost_per", "amount_owned", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["symbol", "XRP"], ["user_id", 2], ["cost_per", 2.0], ["amount_owned", 4.0], ["created_at", "2019-10-12 08:44:16.344716"], ["updated_at", "2019-10-12 08:44:16.344716"]]
---
  def create
    @cryp = Cryp.new(cryp_params)

    respond_to do |format|
      if @cryp.save

DELETE FROM "cryps" WHERE "cryps"."id" = ?  [["id", 19]]
---
  def destroy
    @cryp.destroy

SELECT  "cryps".* FROM "cryps" WHERE "cryps"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_cryp
      @cryp = Cryp.find(params[:id])

SELECT  "cryps".* FROM "cryps" WHERE "cryps"."user_id" = ? AND "cryps"."id" = ? LIMIT ?  [["user_id", 2], ["id", 20], ["LIMIT", 1]]
---
    def correct_user
      @correct = current_user.cryps.find_by(id: params[:id])